tap "koekeishiya/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Intuitive find & replace CLI
brew "sd"
# TOML toolkit written in Rust
brew "taplo"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-consolas-for-powerline"
cask "font-fira-code"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Utility to hide the notch
cask "topnotch"
# Rust-based terminal
cask "warp"
vscode "aaron-bond.better-comments"
vscode "akhilputhiry.sqltools-trino-driver"
vscode "andenetalexander.vim-cheatsheet"
vscode "anysphere.cursorpyright"
vscode "bocovo.dbml-erd-visualizer"
vscode "bungcip.better-toml"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "dbcode.dbcode"
vscode "diogonolasco.pyinit"
vscode "eamodio.gitlens"
vscode "franneck94.vscode-python-config"
vscode "franneck94.vscode-python-dev-extension-pack"
vscode "github.github-vscode-theme"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "narasimapandiyan.jetbrainsmono"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "redhat.vscode-yaml"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "rooveterinaryinc.roo-cline"
vscode "tamasfe.even-better-toml"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
